---
- name: data_stream.type
  type: constant_keyword
  description: Data stream type.
- name: data_stream.dataset
  type: constant_keyword
  description: Data stream dataset.
- name: data_stream.namespace
  type: constant_keyword
  description: Data stream namespace.
- name: "@timestamp"
  type: date
  description: "Event timestamp."
- name: "event.category"
  type: keyword
  description: "Event category, such as authentication, configuration, or web."
- name: "event.type"
  type: keyword
  description: "Event type, such as access, error, or info."
- name: "event.dataset"
  type: keyword
  description: "Dataset name for the event, in this case, `ubika.waap`."
- name: "event.risk_score"
  type: float
  description: "Risk score associated with the event."
- name: "event.kind"
  type: keyword
  description: "Kind of event, such as event or state."
- name: "event.severity"
  type: integer
  description: "Severity level of the event."
- name: "event.reason"
  type: text
  description: "Reason or explanation for the event."
- name: "host.name"
  type: keyword
  description: "Name of the host or appliance generating the event."
- name: "client.ip"
  type: ip
  description: "Source IP address of the client."
- name: "destination.ip"
  type: ip
  description: "Destination IP address."
- name: "destination.port"
  type: integer
  description: "Destination port number."
- name: "http.request.method"
  type: keyword
  description: "HTTP method used in the request, such as GET or POST."
- name: "http.request.headers.key"
  type: keyword
  description: "HTTP header field name."
- name: "http.request.headers.value"
  type: text
  description: "HTTP header field value."
- name: "url.path"
  type: keyword
  description: "Path portion of the URL."
- name: "url.domain"
  type: keyword
  description: "Domain of the URL."